{
	"id": "sound-blaster-dsp-commands",
	"schema": {
		"version": 1
	},
	"source": {
		"id": "dosbox-x",
		"type": "website"
	},
	"notes": [
		"Time constant: A side effect of 256 - 1000000/freq is that it is impossible to precisely represent standard frequencies like 11025Hz this way.",
		"The lowest sample rate possible this way is 3906Hz (256 - 1000000/3096 = 0x00), the highest is 1MHz (256 - 1000000/1000000 = 256 - 1 = 0xFF) although for obvious reasons the DSP caps the sample rate at what it can support.\nOn real Creative hardware the maximum rate is about 45454Hz for 'high speed' playback (DSP 2.0 or higher) and 22727Hz for normal non-highspeed playback (original Sound Blaster and Sound Blaster Pro when non-highspeed playback is involved).",
		"For Sound Blaster Pro stereo, double the frequency before computing the time constant and set a bit in the mixer register to enable stereo playback. DSP stereo playback is effectively equivalent to monural playback at twice the sample rate. Due to a bug in Sound Blaster 16 hardware, the mixer bit for Pro stereo does not work and Pro style playback will result in a scratchy monural rendition of the audio. Clone cards correctly emulate the mixer stereo bit.",
		"The ADPCM playback modes have an even lower sample rate cap (13KHz-16KHz) due to limitations in DSP processing power. DOSLIB testing with real hardware shows that ADPCM commands can be driven faster than the limit at the cost that alising artifacts occur because the DSP cannot keep up.",
		"Sound Blaster clones may impose additional limits on supported upper and lower sample rates, or they can fail to impose limits and support supersonic sample rates given ideal bus and memory conditions even if not an intended mode of operation.",
		"Sound Blaster 16 allows the time constant to specify up to 45454Hz whether or not 'high-speed DMA' commands are involved, contrary to earlier Sound Blaster hardware. Due to a bug in the Sound Blaster 16 DSP, this command is the only way to get 3906Hz playback as the SB16 set sample rate command limit playback to just above 4000Hz. Sound Blaster 16 will, and most clones may, convert the time code to a sample rate and then round the sample rate to some nearest multiple supported by the card, while original Sound Blaster and Pro hardware will produce exactly the expected rate. Older Sound Blaster 16 DSPs have a bug in the DSP that for nonstandard rates can cause unexpected erroneously low sample rates.",
		"The Sound Blaster 16 DSP playback/record commands accept a bit to enable/disable the FIFO. You should enable the FIFO to avoid any issues should the ISA bus experience any delays. If the FIFO is enabled, the card appears to buffer around 8 to 14 samples. If the FIFO is disabled, the card buffers only 1 sample the same as earlier cards. The FIFO should be disabled for single cycle or else the card will fail to play the last 8 to 14 samples of the block. On SB16 hardware, Pro and older playback commands always behave as if the FIFO is disabled.",
		"Auto-init DSP playback was added in DSP version 2.0 firmware. That does not necessarily imply the card came with DSP version 2.0, Creative allowed replacement of the DSP chip on Sound Blaster 1.x cards with DSP 2.0. The auto-init mode directs the DSP to begin DMA playback and not automatically stop after the DSP block, but to signal an interrupt and continue playing. Prior to auto-init, DSP 1.x offered only the single-cycle command and it was necessary for the interrupt handler to send command 14h again, potentially causing a small audio glitch depending on bus delay and how fast the interrupt handler could do it.",
		"Be warned that clone cards may not properly support auto-init, or may mis-implement unusual use cases, even if the card reports DSP version 2.0. It is known that the Gravis Ultrasound emulation software does not support auto-init, nor does the built-in Sound Blaster emulation in Windows XP.",
		"'High speed' DMA DSP commands are required to exceed 22050Hz mono and 11025Hz stereo on Sound Blaster 2.01 and Pro cards however in this state the DSP is only able to provide the higher rate by ignoring DSP commands and can only respond to a DSP reset. Sound Blaster 16 cards do not require the high speed commands to exceed those limits. Clone cards may or may not enforce the requirement for 'High speed' DSP playback commands.",
		"Sound Blaster 16 undocumented commands 45h and 47h (continue auto-init DMA) set the auto-init mode in playback, but as noted from real hardware testing, do not automatically resume playback if it has stopped."
	],
	"csv interpret newline": true,
	"table in csv": true
}
